:PROPERTIES:
:ID:       dd64f171-f66c-41e5-9238-c8710605095f
:END:
#+TITLE: Guix Java: Helm Chartmap
#+CATEGORY: slips
#+TAGS:

** Query Guix

Running =guix show $plugin 2>/dev/null | recsel -P "version"= will show the
available package version.

#+name: guixMavenPlugins
#+begin_src sh :var plugins=mavenPlugins[,1] versions=mavenPlugins[,2] :results output table
# echo $mvnPlugins
i=0
# declare -a versions
# versions=($versions)
read -a versions < <(echo $versions)
echo ${plugins[@]} | while read -r -d ' ' plugin; do
    reqversion=${versions[$i]}
    guixversion="$(guix show $plugin 2>/dev/null | recsel -P "version")"
    # guixfound=$? # handle errors some other way

    echo $plugin $reqversion $guixversion
    ((i++))
done
#+end_src

#+RESULTS: guixMavenPlugins
| jacoco-maven-plugin   |    0.8.8 |       |
| maven-compiler-plugin |   3.10.1 | 3.8.1 |
| maven-enforcer-plugin |    3.1.0 | 3.0.0 |
| maven-failsafe-plugin | 3.0.0-M7 |       |
| maven-gpg-plugin      |    3.0.1 |       |
| maven-help-plugin     |    3.3.0 |       |
| maven-jar-plugin      |    3.3.0 | 3.2.0 |
| maven-javadoc-plugin  |    3.4.1 |       |
| maven-shade-plugin    |    3.4.0 |       |
| maven-source-plugin   |    3.2.1 |       |

